src/cf/InformationRegisters/НастройкиОрганизацийМЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиОрганизацийМЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АдресМЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидВходящегоДокументаПоУмолчанию</Name>
					<Comment>Специфичен для конфигурации Документооборот, при внедрении в другую конфигурацию может быть не актуален</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВидДокументаМЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрифИнформацияОграниченногоРаспространения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГрифДоступаМЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрифОбычнаяИнформация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГрифДоступаМЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторМЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КаталогОтправки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КаталогОтправкиFTP</Name>
					<Comment>Будет удален - концепция поменялась</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КаталогПолучения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КаталогПолученияFTP</Name>
					<Comment>Будет удален - концепция поменялась</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеМЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегШтампСверху</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегШтампСлева</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбмена</Name>
					<Comment>Будет удален - концепция поменялась</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОбменаМЭДО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтраницаВставкиРегШтампа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтраницаВставкиКартинки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтраницаВставкиШтампаЭП</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтраницаВставкиКартинки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьРазмерПорции</Name>
					<Comment>Удален в релизе 3.0.10</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШтампСверху</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШтампСлева</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиОрганизацийМЭДО/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоОрганизациям") Тогда
		Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
		
		Для Каждого Запись Из ЭтотОбъект Цикл
			Запись.Организация = Организация;
		КонецЦикла;
	КонецЕсли;
	
	Если МЭДОПереопределяемый.ЭтоМиграция() Тогда
		Возврат; // При миграции тоже не нужно проверять, но организацию нужно заполнить (выше).
	КонецЕсли;
	
	
	// У разных организаций не могут между собой пересекаться каталоги отправки и получения, иначе не понятно, по какой
	// организации загружать.
	// 
	Для Каждого Запись Из ЭтотОбъект Цикл
		// Обычно всегда будет набор из 1 записи.
		//@skip-check query-in-loop
		ПроверитьСовпадениеКаталогов(Запись, Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Запись.КаталогОтправки) 
			И Не МЭДО.ПроверитьСуществуетЛиКаталог(Запись.КаталогОтправки, Неопределено) Тогда
			Отказ = Истина;
		КонецЕсли;
		Если ЗначениеЗаполнено(Запись.КаталогПолучения) 
			И Не МЭДО.ПроверитьСуществуетЛиКаталог(Запись.КаталогПолучения, Неопределено) Тогда
			Отказ = Истина;
		КонецЕсли;
		
		Если Не СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(Запись.ИдентификаторМЭДО) Тогда
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru = 'Идентификатор МЭДО должен иметь вид: xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx'"),
				,
				"ИдентификаторМЭДО",
				"Запись",
				Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьСовпадениеКаталогов(Запись, Отказ)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Настройки.Организация
		|ИЗ
		|	РегистрСведений.НастройкиОрганизацийМЭДО КАК Настройки
		|ГДЕ
		|	Настройки.Организация <> &Организация
		|	И (
		|		Настройки.КаталогОтправки = &КаталогОтправки
		|		ИЛИ Настройки.КаталогПолучения = &КаталогПолучения
		|	)");
	Запрос.УстановитьПараметр("Организация", Запись.Организация);
	Запрос.УстановитьПараметр("КаталогОтправки", Запись.КаталогОтправки);
	Запрос.УстановитьПараметр("КаталогПолучения", Запись.КаталогПолучения);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон(НСтр("ru = 'Обнаружено совпадение каталогов обмена с %1'"), Выборка.Организация),
			Выборка.Организация, , , Отказ);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе

#Область Инициализация

ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");

#Конецобласти

#КонецЕсли
